# Discriptive Statistics : Mean, Median, Mode

## Import Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

## Read the data

In [2]:
data_frame = pd.read_csv("Data.csv")

In [3]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 2 columns):
New York City    11 non-null float64
Los Angeles      11 non-null object
dtypes: float64(1), object(1)
memory usage: 256.0+ bytes

In [4]:
data_frame

    New York City Los Angeles
0             1.0       1.00
1             2.0       2.00
2             3.0       3.00
3             3.0       4.00
4             5.0       5.00
5             6.0       6.00
6             7.0       7.00
7             8.0       8.00
8             9.0       9.00
9            11.0      10.00
10           66.0

In [5]:
data_frame['Los Angeles'] = pd.to_numeric(data_frame['Los Angeles'], errors='coerce')

In [6]:
data_frame

    New York City  Los Angeles
0             1.0          1.0
1             2.0          2.0
2             3.0          3.0
3             3.0          4.0
4             5.0          5.0
5             6.0          6.0
6             7.0          7.0
7             8.0          8.0
8             9.0          9.0
9            11.0         10.0
10           66.0          NaN

## Mean

In [7]:
data_frame['New York City'].mean()

11.0

In [8]:
data_frame['Los Angeles'].mean()

5.5

## Median

In [42]:
data_frame.describe()

       New York City  Los Angeles
count      11.000000     10.00000
mean       11.000000      5.50000
std        18.504054      3.02765
min         1.000000      1.00000
25%         3.000000      3.25000
50%         6.000000      5.50000
75%         8.500000      7.75000
max        66.000000     10.00000

In [43]:
data_frame.describe().loc['50%']

New York City    6.0
Los Angeles      5.5
Name: 50%, dtype: float64

In [46]:
data_frame.median()

New York City    6.0
Los Angeles      5.5
dtype: float64

In [47]:
data_frame.median()[0]

6.0

### Mode

In [48]:
data_frame.mode()

   New York City  Los Angeles
0            3.0          1.0
1            NaN          2.0
2            NaN          3.0
3            NaN          4.0
4            NaN          5.0
5            NaN          6.0
6            NaN          7.0
7            NaN          8.0
8            NaN          9.0
9            NaN         10.0